open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
/****************************************************************************
 * chips/bk7258/ap/
 * bk7258_ap_smp.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * N8-B1 through N8-C4 physical CPU2 secondary bootstrap.  N8-C1 enters the
 * logical CPU1 scheduler IDLE path through the SDK-wrapped mailbox IPI data
 * plane.  N8-C2 remote-dispatches exactly one CPU1-affinity pthread; N8-C3
 * proves its first semaphore block/wake and N8-C4 reuses that same task and
 * semaphore for a fixed eight-cycle wake loop.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "bk7258_kernel_compat.h"

#ifdef CONFIG_BK7258_AP_SMP_BOOTSTRAP

#include <errno.h>
#ifdef CONFIG_BK7258_AP_SMP_CPU1_AFFINITY
#  include <pthread.h>
#endif
#include <sched.h>
#include <stdint.h>
#include <string.h>
#include <sys/types.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
#  include <nuttx/init.h>
#endif
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
#  include <nuttx/irq.h>
#  include <nuttx/semaphore.h>
#endif
#include <nuttx/sched.h>
#include <nuttx/spinlock.h>
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
#  include <nuttx/sched_note.h>
#endif

#include <arch/chip/bk7258_amp.h>
#include <arch/chip/irq.h>

#include "arm_internal.h"
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
#  include "nvic.h"
#  include "sched/sched.h"
#  include "bk7258_sdk_irq.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#if !defined(CONFIG_SMP)
#  error CONFIG_BK7258_AP_SMP_BOOTSTRAP requires CONFIG_SMP
#endif

#if CONFIG_SMP_NCPUS != 2
#  error N8-B supports exactly two AP logical CPUs
#endif

#if CONFIG_SMP_DEFAULT_CPUSET != 0x1
#  error N8-C1/N8-C2/N8-C3/N8-C4 must keep ordinary tasks on AP logical CPU0
#endif

#if defined(CONFIG_BK7258_AP_SMP_SCHED_ONLINE) && \
    !defined(CONFIG_BK7258_AP_IPI)
#  error BK7258 scheduler-online mode requires the SDK-wrapped AP IPI
#endif

#if defined(CONFIG_BK7258_AP_SMP_CPU1_AFFINITY) && \
    !defined(CONFIG_BK7258_AP_SMP_SCHED_ONLINE)
#  error BK7258 CPU1 affinity gate requires scheduler-online mode
#endif

#if defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE) && \
    !defined(CONFIG_BK7258_AP_SMP_CPU1_AFFINITY)
#  error BK7258 CPU1 semaphore-wake gate requires the affinity gate
#endif

#if defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP) && \
    !defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE)
#  error BK7258 CPU1 semaphore-wake loop requires the N8-C3 wake gate
#endif

#define BK7258_SCB_VTOR             (*(volatile uint32_t *)0xe000ed08u)
#define BK7258_SCB_CCR              (*(volatile uint32_t *)0xe000ed14u)
#define BK7258_SCB_CFSR             (*(volatile uint32_t *)0xe000ed28u)
#define BK7258_SCB_HFSR             (*(volatile uint32_t *)0xe000ed2cu)
#define BK7258_SCB_CPACR            (*(volatile uint32_t *)0xe000ed88u)
#define BK7258_MPU_CTRL             (*(volatile uint32_t *)0xe000ed94u)
#define BK7258_FPU_FPCCR            (*(volatile uint32_t *)0xe000ef34u)
#define BK7258_SYSTICK_CTRL          (*(volatile uint32_t *)0xe000e010u)
#define BK7258_SYSTICK_RELOAD        (*(volatile uint32_t *)0xe000e014u)
#define BK7258_SYSTICK_CURRENT       (*(volatile uint32_t *)0xe000e018u)
#define BK7258_SYSTICK_CTRL_ENABLE   (1u << 0)
#define BK7258_AP_PRIMARY_CPU       0
#define BK7258_AP_SECONDARY_CPU     1
#define BK7258_CPU2_LOCAL_CORE_ID   1u
#define BK7258_CPU2_PHYSICAL_ID     2u
#define BK7258_CPU2_VECTOR_COUNT    80u
#define BK7258_CPU2_FRAME_WORDS     8u
#define BK7258_CPU2_INVALID_VALUE   UINT32_MAX
#define BK7258_AP_PRIMARY_MASK      (1u << BK7258_AP_PRIMARY_CPU)
#define BK7258_AP_ONLINE_MASK       ((1u << BK7258_AP_PRIMARY_CPU) | \
                                     (1u << BK7258_AP_SECONDARY_CPU))
#define BK7258_CPU2_ONLINE_VECTOR_XOR (1u << 8)
#define BK7258_CPU2_IDLE_VECTOR_XOR   (1u << 9)
#define BK7258_CPU2_UNLOCK_VECTOR_XOR (1u << 10)

/****************************************************************************
 * External Function Prototypes / Data
 ****************************************************************************/

extern void exception_common(void);
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
extern void __real_nx_bringup(void);
#endif
extern void bk7258_ap_smp_memory_initialize(void);
extern const void *const
  __vector_core1_table[BK7258_CPU2_VECTOR_COUNT];

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
static struct smp_call_data_s g_bk7258_ap_smp_forward_call;
static struct smp_call_data_s g_bk7258_ap_smp_reverse_call;
#endif

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
static sem_t g_bk7258_ap_cpu1_sem;
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void bk7258_cpu2_fpu_initialize(void)
{
  /* Match CPU0's reset contract before touching any cross-core state. */

  bk7258_ap_smp_memory_initialize();

  /* Match the primary AP core before CPU2 can enter exception_common. */

  BK7258_SCB_CPACR &= ~((3u << 20) | (3u << 22));
  __asm volatile ("dsb sy; isb sy" ::: "memory");
  BK7258_FPU_FPCCR &= ~((1u << 31) | (1u << 30) | (1u << 29));
#ifdef CONFIG_ARCH_FPU
  /* 每个核独立建立 NuttX 浮点上下文，不能继承另一核的 FPCA 状态。 */

  arm_fpuconfig();
#else
  BK7258_SCB_CPACR |= ((3u << 20) | (3u << 22));
#endif
  __asm volatile ("dsb sy; isb sy" ::: "memory");
}

static inline volatile uint32_t *bk7258_cpu2_control(void)
{
  return (volatile uint32_t *)(uintptr_t)BK7258_SYS_CPU2_CONTROL;
}

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
static void bk7258_cpu2_signal_boot_ready(void)
{
  volatile uint32_t *control = bk7258_cpu2_control();
  uint32_t value = *control;

  /* Tell CPU0 that CPU2 has completed all bootstrap work which must run
   * before up_cpu_start() releases NuttX's scheduler critical section.
   * Entering the secondary scheduler first would deadlock: CPU0 waits for
   * CPU2 while arm_initialize_stack()/this_cpu() waits for CPU0.
   */

  value &= ~BK7258_SYS_CPU2_BOOT_MASK;
  value |=
    ((uint32_t)(uintptr_t)__vector_core1_table &
     BK7258_SYS_CPU2_BOOT_MASK) ^ BK7258_CPU2_ONLINE_VECTOR_XOR;
  *control = value;
  __asm volatile ("dsb sy; sev" ::: "memory");
}

