open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
static void bk7258_cpu2_wait_idle_release(void)
{
  volatile uint32_t *control = bk7258_cpu2_control();
  uint32_t expected_vector =
    (uint32_t)(uintptr_t)__vector_core1_table &
    BK7258_SYS_CPU2_BOOT_MASK;
  uint32_t idle_vector =
    expected_vector ^ BK7258_CPU2_IDLE_VECTOR_XOR;
  uint32_t value;

  /* CPU0 publishes this token only after nx_bringup() has returned.  Use the
   * uncached system-control register for the handoff because a CPU-only reset
   * can leave each STAR core with a different private copy of NuttX's global
   * initialization state.
   */

  for (;;)
    {
      value = *control;
      if ((value & BK7258_SYS_CPU2_BOOT_MASK) == idle_vector)
        {
          break;
        }

      __asm volatile ("wfe" ::: "memory");
    }

  value &= ~BK7258_SYS_CPU2_BOOT_MASK;
  value |= expected_vector;
  *control = value;
  __asm volatile ("dsb sy; isb sy" ::: "memory");
}

static void bk7258_cpu2_signal_idle_release(void)
{
  volatile uint32_t *control = bk7258_cpu2_control();
  uint32_t value = *control;

  value &= ~BK7258_SYS_CPU2_BOOT_MASK;
  value |=
    ((uint32_t)(uintptr_t)__vector_core1_table &
     BK7258_SYS_CPU2_BOOT_MASK) ^ BK7258_CPU2_IDLE_VECTOR_XOR;
  *control = value;
  __asm volatile ("dsb sy; sev" ::: "memory");
}

static void bk7258_cpu2_signal_scheduler_unlocked(void)
{
  volatile uint32_t *control = bk7258_cpu2_control();
  uint32_t expected_vector =
    (uint32_t)(uintptr_t)__vector_core1_table &
    BK7258_SYS_CPU2_BOOT_MASK;
  uint32_t value = *control;

  value &= ~BK7258_SYS_CPU2_BOOT_MASK;
  value |= expected_vector ^ BK7258_CPU2_UNLOCK_VECTOR_XOR;
  *control = value;
  __asm volatile ("dsb sy; sev" ::: "memory");

  /* CPU0 clears the token after it has left the nx_bringup() wrapper.
   * Keep CPU2's interrupts disabled until that acknowledgement arrives.
   * Otherwise sched_unlock() may send a scheduler IPI which switches CPU0
   * away while it is still waiting for this token.
   */

  for (;;)
    {
      value = *control;
      if ((value & BK7258_SYS_CPU2_BOOT_MASK) == expected_vector)
        {
          break;
        }

      __asm volatile ("wfe" ::: "memory");
    }

  __asm volatile ("dsb sy; isb sy" ::: "memory");
}

static void bk7258_cpu2_wait_scheduler_unlocked(void)
{
  volatile uint32_t *control = bk7258_cpu2_control();
  uint32_t expected_vector =
    (uint32_t)(uintptr_t)__vector_core1_table &
    BK7258_SYS_CPU2_BOOT_MASK;
  uint32_t unlocked_vector =
    expected_vector ^ BK7258_CPU2_UNLOCK_VECTOR_XOR;
  uint32_t value;

  /* Do not let CPU0 and CPU2 release their startup scheduler locks at the
   * same time.  On a cold CPU-only reset, the private data caches can make
   * that lock handoff invisible even though both cores execute the normal
   * NuttX unlock path.
   */

  for (;;)
    {
      value = *control;
      if ((value & BK7258_SYS_CPU2_BOOT_MASK) == unlocked_vector)
        {
          break;
        }

      __asm volatile ("wfe" ::: "memory");
    }

  value &= ~BK7258_SYS_CPU2_BOOT_MASK;
  value |= expected_vector;
  *control = value;
  __asm volatile ("dsb sy; isb sy" ::: "memory");

}
#endif

static void bk7258_cpu2_hold_reset(
  volatile struct bk7258_cpu2_probe_state_s *state)
{
  volatile uint32_t *control = bk7258_cpu2_control();
  uint32_t value = *control;

  value &= ~BK7258_SYS_CPU2_RESET;
  *control = value;
  __asm volatile ("dsb sy; isb sy" ::: "memory");

  if (state != NULL)
    {
      state->control_after = value;
      __asm volatile ("dmb sy" ::: "memory");
    }
}

static int bk7258_cpu2_wait(uint32_t wanted, uint32_t timeout_ms)
{
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  volatile uint32_t *control = bk7258_cpu2_control();
  uint32_t expected_vector =
    (uint32_t)(uintptr_t)__vector_core1_table &
    BK7258_SYS_CPU2_BOOT_MASK;
  uint32_t online_vector =
    expected_vector ^ BK7258_CPU2_ONLINE_VECTOR_XOR;
  uint32_t sys_control;

  (void)wanted;
#else
  volatile struct bk7258_cpu2_probe_state_s *state =
    bk7258_cpu2_probe_state();
  uint32_t current;
#endif
  uint64_t elapsed_cycles = 0;
  uint64_t timeout_cycles;
  uint32_t period;
  uint32_t last;
  uint32_t now;

  /* nx_start() calls this while CPU0 owns the scheduler critical section and
   * CPU2 is becoming online.  NuttX clock access reaches up_irq_save(), which
   * can try to acquire the same SMP scheduler lock.  Scheduler sleeps are not
   * available either.  Read the already-running SysTick counter directly so
   * this bootstrap wait depends on neither facility nor delay-loop clock
   * calibration left by the loader.
   */

  period = BK7258_SYSTICK_RELOAD + 1u;
  if ((BK7258_SYSTICK_CTRL & BK7258_SYSTICK_CTRL_ENABLE) == 0 ||
      period == 0)
    {
      return -ETIMEDOUT;
    }

  timeout_cycles = (uint64_t)period * MSEC2TICK(timeout_ms);
  last = BK7258_SYSTICK_CURRENT;

  for (;;)
    {
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
      /* A cold CPU-only reset can retain a CPU0 cache line even after the
       * architectural cache and MPU controls have been changed.  CPU2
       * therefore acknowledges scheduler entry through its uncached system
       * control register.  The boot-vector field only takes effect on a
       * future CPU2 reset, so one bit is a safe transient online token.
       */

      sys_control = *control;
      if ((sys_control & BK7258_SYS_CPU2_BOOT_MASK) == online_vector)
        {
          sys_control &= ~BK7258_SYS_CPU2_BOOT_MASK;
          sys_control |= expected_vector;
          *control = sys_control;
          __asm volatile ("dsb sy; isb sy" ::: "memory");
          return OK;
        }
#else
      current = state->state;
      __asm volatile ("dmb sy" ::: "memory");
      if (current == wanted)
        {
          return OK;
        }

      if (current == BK7258_CPU2_PROBE_STATE_FAILED)
        {
          return -EIO;
        }
#endif

      now = BK7258_SYSTICK_CURRENT;
      if (last >= now)
        {
          elapsed_cycles += last - now;
        }
      else
        {
          elapsed_cycles += last + (period - now);
        }

