open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
      last = now;
      if (elapsed_cycles >= timeout_cycles)
        {
          break;
        }
    }

  return -ETIMEDOUT;
}

static void bk7258_cpu2_fail(uint32_t error)
{
  volatile struct bk7258_cpu2_probe_state_s *state =
    bk7258_cpu2_probe_state();

  state->secondary_ready = 0;
  state->error = error;
  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_CPU2_PROBE_STATE_FAILED;
  __asm volatile ("dmb sy" ::: "memory");
  up_clean_dcache((uintptr_t)state,
                  (uintptr_t)state + sizeof(*state));
  __asm volatile ("dsb sy; isb sy" ::: "memory");
}

#ifndef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
static void bk7258_cpu2_note_missing_ipi(void)
{
  volatile struct bk7258_cpu2_probe_state_s *state =
    bk7258_cpu2_probe_state();

  if (state->magic == BK7258_CPU2_PROBE_STATE_MAGIC &&
      state->version == BK7258_CPU2_PROBE_STATE_VERSION)
    {
      state->smp_call_requests++;
      if (state->error == BK7258_CPU2_PROBE_ERROR_NONE)
        {
          state->error = BK7258_CPU2_PROBE_ERROR_IPI_UNAVAILABLE;
        }

      __asm volatile ("dmb sy; sev" ::: "memory");
    }
}
#endif

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
static int bk7258_cpu2_scheduler_irq_initialize(void)
{
  int ret;

  ret = up_prioritize_irq(NVIC_IRQ_PENDSV, NVIC_SYSH_PRIORITY_MIN);
  if (ret < 0)
    {
      return ret;
    }

  ret = up_prioritize_irq(NVIC_IRQ_SVCALL, NVIC_SYSH_SVCALL_PRIORITY);
  if (ret < 0)
    {
      return ret;
    }

  __asm volatile ("dsb sy; isb sy" ::: "memory");
  return OK;
}

static int bk7258_ap_smp_primary_callback(FAR void *arg)
{
  volatile struct bk7258_ap_smp_state_s *state = arg;

  if (state == NULL || up_cpu_index() != BK7258_AP_PRIMARY_CPU)
    {
      return -EINVAL;
    }

  state->callback_count[BK7258_AP_PRIMARY_CPU]++;
  state->last_callback_cpu = BK7258_AP_PRIMARY_CPU;
  __asm volatile ("dmb sy" ::: "memory");
  return OK;
}

static int bk7258_ap_smp_secondary_callback(FAR void *arg)
{
  volatile struct bk7258_ap_smp_state_s *state = arg;

  if (state == NULL || up_cpu_index() != BK7258_AP_SECONDARY_CPU)
    {
      return -EINVAL;
    }

  state->callback_count[BK7258_AP_SECONDARY_CPU]++;
  state->last_callback_cpu = BK7258_AP_SECONDARY_CPU;
  __asm volatile ("dmb sy" ::: "memory");

  nxsched_smp_call_init(&g_bk7258_ap_smp_reverse_call,
                        bk7258_ap_smp_primary_callback,
                        (FAR void *)state);
  return nxsched_smp_call_single_async(BK7258_AP_PRIMARY_CPU,
                                      &g_bk7258_ap_smp_reverse_call);
}

#ifdef CONFIG_BK7258_AP_SMP_CPU1_AFFINITY
static void bk7258_ap_affinity_fail(
  volatile struct bk7258_ap_affinity_state_s *state, uint32_t error)
{
  if (state->error == BK7258_AP_AFFINITY_ERROR_NONE)
    {
      state->error = error;
    }

  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_AFFINITY_STATE_FAILED;
  __asm volatile ("dmb sy; sev" ::: "memory");
}

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
static void bk7258_ap_sem_wake_fail(
  volatile struct bk7258_ap_sem_wake_state_s *state, uint32_t error)
{
  if (state->error == BK7258_AP_SEM_WAKE_ERROR_NONE)
    {
      state->error = error;
    }

  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_SEM_WAKE_STATE_FAILED;
  __asm volatile ("dmb sy; sev" ::: "memory");
}

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
static void bk7258_ap_sem_wake_loop_fail(
  volatile struct bk7258_ap_sem_wake_loop_state_s *state,
  uint32_t error)
{
  if (state->error == BK7258_AP_SEM_WAKE_LOOP_ERROR_NONE)
    {
      state->error = error;
    }

  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_SEM_WAKE_LOOP_STATE_FAILED;
  __asm volatile ("dmb sy; sev" ::: "memory");
}

static uint32_t bk7258_ap_sem_wake_loop_sem_error(uint32_t error)
{
  switch (error)
    {
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_WAIT_TIMEOUT:
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_WAKE_TIMEOUT:
        return BK7258_AP_SEM_WAKE_ERROR_WAIT_TIMEOUT;
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_SEM_WAIT:
        return BK7258_AP_SEM_WAKE_ERROR_SEM_WAIT;
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_SEM_POST:
        return BK7258_AP_SEM_WAKE_ERROR_SEM_POST;
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_CPU:
        return BK7258_AP_SEM_WAKE_ERROR_BAD_CPU;
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_COUNT_MISMATCH:
        return BK7258_AP_SEM_WAKE_ERROR_COUNT_MISMATCH;
      default:
        return BK7258_AP_SEM_WAKE_ERROR_BAD_STATE;
    }
}

static uint32_t bk7258_ap_sem_wake_loop_affinity_error(uint32_t error)
{
  switch (error)
    {
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_WAIT_TIMEOUT:
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_WAKE_TIMEOUT:
        return BK7258_AP_AFFINITY_ERROR_TIMEOUT;
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_CPU:
        return BK7258_AP_AFFINITY_ERROR_BAD_CPU;
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_SEQUENCE:
      case BK7258_AP_SEM_WAKE_LOOP_ERROR_COUNT_MISMATCH:
        return BK7258_AP_AFFINITY_ERROR_COUNT_MISMATCH;
      default:
        return BK7258_AP_AFFINITY_ERROR_BAD_STATE;
    }
}
#endif

static int32_t bk7258_ap_sem_exact_waiter_value(
  pthread_t thread, cpu_set_t cpuset)
{
  FAR struct tcb_s *tcb;
  irqstate_t flags;
  int32_t observed = INT32_MAX;
  int value = 0;
  int ret;

  tcb = nxsched_get_tcb((pid_t)thread);
  if (tcb == NULL)
    {
      return observed;
    }

  flags = enter_critical_section();
  ret = nxsem_get_value(&g_bk7258_ap_cpu1_sem, &value);
  if (ret >= 0 &&
      tcb->task_state == TSTATE_WAIT_SEM &&
      tcb->waitobj == (FAR void *)&g_bk7258_ap_cpu1_sem &&
      value == -1 && tcb->affinity == cpuset)
    {
      observed = (int32_t)value;
    }

  leave_critical_section(flags);
  nxsched_put_tcb(tcb);
  __asm volatile ("dmb sy" ::: "memory");
  return observed;
}

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
static void bk7258_ap_sem_wake_loop_task_fail(
  volatile struct bk7258_ap_affinity_state_s *affinity,
  volatile struct bk7258_ap_sem_wake_state_s *sem_state,
  volatile struct bk7258_ap_sem_wake_loop_state_s *loop_state,
  uint32_t error, uint32_t cycle)
{
  bk7258_ap_sem_wake_loop_fail(loop_state, error);
  if (cycle == 1 && loop_state->completed_cycles == 0)
    {
      bk7258_ap_sem_wake_fail(
        sem_state, bk7258_ap_sem_wake_loop_sem_error(error));
    }

  bk7258_ap_affinity_fail(
    affinity, bk7258_ap_sem_wake_loop_affinity_error(error));
  __asm volatile ("dmb sy; sev" ::: "memory");
}

static int bk7258_ap_sem_wake_loop_abort(
  volatile struct bk7258_ap_affinity_state_s *affinity,
  volatile struct bk7258_ap_sem_wake_state_s *sem_state,
  volatile struct bk7258_ap_sem_wake_loop_state_s *loop_state,
  uint32_t error, int first_cycle_completed, int sem_initialized,
  int ret)
{
  bk7258_ap_sem_wake_loop_fail(loop_state, error);
  if (!first_cycle_completed)
    {
      bk7258_ap_sem_wake_fail(
        sem_state, bk7258_ap_sem_wake_loop_sem_error(error));
    }

  bk7258_ap_affinity_fail(
    affinity, bk7258_ap_sem_wake_loop_affinity_error(error));
  if (sem_initialized && affinity->task_completed == 0)
    {
      (void)nxsem_post(&g_bk7258_ap_cpu1_sem);
    }

  __asm volatile ("dmb sy; sev" ::: "memory");
  return ret;
}
#endif

