open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
/* Do not take a TCB reference here.  If CPU1 is already in
 * nxsched_release_pid(), CPU0 releasing that reference can wake exit_sem and
 * add an extra scheduler IPI to the N8-C3/N8-C4 measurement window.
 */

static int bk7258_ap_pid_released(pthread_t thread)
{
  pid_t pid = (pid_t)thread;
  irqstate_t flags;
  int released = 1;
  int hash_ndx;

  flags = spin_lock_irqsave_notrace(&g_pidhashlock);
  if (g_pidhash != NULL && g_npidhash > 0 && pid >= 0)
    {
      hash_ndx = PIDHASH(pid);
      if (g_pidhash[hash_ndx] != NULL &&
          g_pidhash[hash_ndx]->pid == pid)
        {
          released = 0;
        }
    }

  spin_unlock_irqrestore_notrace(&g_pidhashlock, flags);
  return released;
}
#endif

static FAR void *bk7258_ap_cpu1_affinity_task(FAR void *arg)
{
  volatile struct bk7258_ap_affinity_state_s *state = arg;
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
  volatile struct bk7258_ap_sem_wake_state_s *sem_state =
    bk7258_ap_sem_wake_state();
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  volatile struct bk7258_ap_sem_wake_loop_state_s *loop_state =
    bk7258_ap_sem_wake_loop_state();
  uint32_t cycle;
  uint32_t elapsed;
  uint32_t loop_wait_state;
  uint32_t sem_wait_state;
  uint32_t post_sequence;
  uint32_t published_error;
  uint32_t published_sem_error;
  int continued;
#  else
  uint32_t wait_state;
#  endif
#endif
  cpu_set_t observed = 0;
  pthread_t self = pthread_self();
  int ret;

  if (state == NULL)
    {
      return NULL;
    }

  state->task_id = (uint32_t)self;
  state->task_cpu = (uint32_t)up_cpu_index();
  state->task_started++;
  __asm volatile ("dmb sy" ::: "memory");

  if (state->magic != BK7258_AP_AFFINITY_STATE_MAGIC ||
      state->version != BK7258_AP_AFFINITY_STATE_VERSION ||
      state->size != sizeof(struct bk7258_ap_affinity_state_s) ||
      state->generation != bk7258_ap_boot_state()->generation ||
      state->state != BK7258_AP_AFFINITY_STATE_DISPATCHING)
    {
      bk7258_ap_affinity_fail(state,
                             BK7258_AP_AFFINITY_ERROR_BAD_STATE);
      goto done;
    }

  state->state = BK7258_AP_AFFINITY_STATE_RUNNING;
  __asm volatile ("dmb sy" ::: "memory");

  ret = pthread_getaffinity_np(self, sizeof(observed), &observed);
  state->observed_mask = (uint32_t)observed;

  if (ret != 0)
    {
      bk7258_ap_affinity_fail(state,
                             BK7258_AP_AFFINITY_ERROR_BAD_MASK);
    }
  else if (state->task_cpu != BK7258_AP_SECONDARY_CPU)
    {
      bk7258_ap_affinity_fail(state,
                             BK7258_AP_AFFINITY_ERROR_BAD_CPU);
    }
  else if (state->observed_mask != state->requested_mask)
    {
      bk7258_ap_affinity_fail(state,
                             BK7258_AP_AFFINITY_ERROR_BAD_MASK);
    }
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  else if (sem_state->magic != BK7258_AP_SEM_WAKE_STATE_MAGIC ||
           sem_state->version != BK7258_AP_SEM_WAKE_STATE_VERSION ||
           sem_state->size != sizeof(struct bk7258_ap_sem_wake_state_s) ||
           sem_state->generation != state->generation ||
           sem_state->state != BK7258_AP_SEM_WAKE_STATE_INITIALIZING ||
           sem_state->error != BK7258_AP_SEM_WAKE_ERROR_NONE ||
           loop_state->magic != BK7258_AP_SEM_WAKE_LOOP_STATE_MAGIC ||
           loop_state->version != BK7258_AP_SEM_WAKE_LOOP_STATE_VERSION ||
           loop_state->size !=
             sizeof(struct bk7258_ap_sem_wake_loop_state_s) ||
           loop_state->generation != state->generation ||
           loop_state->state !=
             BK7258_AP_SEM_WAKE_LOOP_STATE_INITIALIZING ||
           loop_state->error != BK7258_AP_SEM_WAKE_LOOP_ERROR_NONE ||
           loop_state->requested_cycles !=
             BK7258_AP_SEM_WAKE_LOOP_CYCLES)
    {
      bk7258_ap_sem_wake_loop_task_fail(
        state, sem_state, loop_state,
        BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE, 1);
    }
  else
    {
      sem_state->task_id = (uint32_t)self;
      for (cycle = 1; cycle <= BK7258_AP_SEM_WAKE_LOOP_CYCLES;
           cycle++)
        {
          __asm volatile ("dmb sy" ::: "memory");
          if (loop_state->state !=
                (cycle == 1 ?
                   BK7258_AP_SEM_WAKE_LOOP_STATE_INITIALIZING :
                   BK7258_AP_SEM_WAKE_LOOP_STATE_CONTINUE) ||
              loop_state->completed_cycles != cycle - 1 ||
              loop_state->wait_entered != cycle - 1 ||
              loop_state->waiter_observed != cycle - 1 ||
              loop_state->post_count != cycle - 1 ||
              loop_state->wait_returned != cycle - 1)
            {
              bk7258_ap_sem_wake_loop_task_fail(
                state, sem_state, loop_state,
                BK7258_AP_SEM_WAKE_LOOP_ERROR_SEQUENCE, cycle);
              goto done;
            }

          loop_state->wait_sequence = cycle;
          loop_state->wait_entered++;
          if (cycle == 1)
            {
              sem_state->wait_entered = 1;
              sem_state->state = BK7258_AP_SEM_WAKE_STATE_WAITING;
            }

          __asm volatile ("dmb sy" ::: "memory");
          loop_state->state = BK7258_AP_SEM_WAKE_LOOP_STATE_WAITING;
          __asm volatile ("dmb sy; sev" ::: "memory");

          ret = nxsem_wait_uninterruptible(&g_bk7258_ap_cpu1_sem);
          __asm volatile ("dmb sy" ::: "memory");
          loop_wait_state = loop_state->state;
          post_sequence = loop_state->post_sequence;
          sem_wait_state = cycle == 1 ? sem_state->state :
            BK7258_AP_SEM_WAKE_STATE_POSTED;
          loop_state->wait_result = (int32_t)ret;
          loop_state->wake_cpu = (uint32_t)up_cpu_index();
          loop_state->wait_returned++;
          if (cycle == 1)
            {
              sem_state->wait_result = (int32_t)ret;
              sem_state->wait_returned = 1;
              sem_state->wake_cpu = loop_state->wake_cpu;
            }

          __asm volatile ("dmb sy" ::: "memory");
          if (ret < 0)
            {
              bk7258_ap_sem_wake_loop_task_fail(
                state, sem_state, loop_state,
                BK7258_AP_SEM_WAKE_LOOP_ERROR_SEM_WAIT, cycle);
              goto done;
            }
          else if (loop_wait_state !=
                     BK7258_AP_SEM_WAKE_LOOP_STATE_POSTED ||
                   sem_wait_state != BK7258_AP_SEM_WAKE_STATE_POSTED)
            {
              bk7258_ap_sem_wake_loop_task_fail(
                state, sem_state, loop_state,
                BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE, cycle);
              goto done;
            }
          else if (post_sequence != cycle)
            {
              bk7258_ap_sem_wake_loop_task_fail(
                state, sem_state, loop_state,
                BK7258_AP_SEM_WAKE_LOOP_ERROR_SEQUENCE, cycle);
              goto done;
            }
          else if (loop_state->post_count != cycle)
            {
              bk7258_ap_sem_wake_loop_task_fail(
                state, sem_state, loop_state,
                BK7258_AP_SEM_WAKE_LOOP_ERROR_COUNT_MISMATCH, cycle);
              goto done;
            }
          else if (loop_state->wake_cpu != BK7258_AP_SECONDARY_CPU)
            {
              bk7258_ap_sem_wake_loop_task_fail(
                state, sem_state, loop_state,
                BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_CPU, cycle);
              goto done;
            }

          loop_state->completed_cycles++;
          loop_state->wake_sequence = cycle;
          if (cycle == 1)
            {
              sem_state->state = BK7258_AP_SEM_WAKE_STATE_WOKEN;
            }

          __asm volatile ("dmb sy" ::: "memory");
          loop_state->state = BK7258_AP_SEM_WAKE_LOOP_STATE_WOKEN;
          __asm volatile ("dmb sy" ::: "memory");

          /* CPU0 publishes the loop error before FAILED.  If its bounded
           * abort raced this wake publication, restore terminal FAILED after
           * the task's last normal state writes instead of leaving
           * error != NONE paired with WOKEN.
           */

