open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
          published_error = loop_state->error;
          if (published_error != BK7258_AP_SEM_WAKE_LOOP_ERROR_NONE)
            {
              bk7258_ap_sem_wake_loop_fail(loop_state, published_error);
              published_sem_error = sem_state->error;
              if (published_sem_error != BK7258_AP_SEM_WAKE_ERROR_NONE)
                {
                  bk7258_ap_sem_wake_fail(sem_state,
                                         published_sem_error);
                }

              bk7258_ap_affinity_fail(
                state,
                bk7258_ap_sem_wake_loop_affinity_error(published_error));
              goto done;
            }

          __asm volatile ("sev" ::: "memory");

          if (cycle < BK7258_AP_SEM_WAKE_LOOP_CYCLES)
            {
              continued = 0;
              for (elapsed = 0;
                   elapsed < BK7258_AP_SEM_WAKE_LOOP_TIMEOUT_MS;
                   elapsed++)
                {
                  __asm volatile ("dmb sy" ::: "memory");
                  loop_wait_state = loop_state->state;
                  if (loop_wait_state ==
                        BK7258_AP_SEM_WAKE_LOOP_STATE_CONTINUE &&
                      loop_state->completed_cycles == cycle &&
                      loop_state->wake_sequence == cycle)
                    {
                      continued = 1;
                      break;
                    }

                  if (loop_wait_state ==
                        BK7258_AP_SEM_WAKE_LOOP_STATE_FAILED ||
                      state->state == BK7258_AP_AFFINITY_STATE_FAILED)
                    {
                      goto done;
                    }

                  /* Use the same state snapshot for all decisions in this
                   * iteration.  CPU0 may publish CONTINUE at any point after
                   * WOKEN; re-reading here could observe that legal
                   * transition after the first comparison and falsely report
                   * a sequence error.
                   */

                  if (loop_wait_state !=
                        BK7258_AP_SEM_WAKE_LOOP_STATE_WOKEN)
                    {
                      bk7258_ap_sem_wake_loop_task_fail(
                        state, sem_state, loop_state,
                        BK7258_AP_SEM_WAKE_LOOP_ERROR_SEQUENCE, cycle);
                      goto done;
                    }

                  __asm volatile ("wfe" ::: "memory");
                }

              if (!continued)
                {
                  bk7258_ap_sem_wake_loop_task_fail(
                    state, sem_state, loop_state,
                    BK7258_AP_SEM_WAKE_LOOP_ERROR_WAKE_TIMEOUT, cycle);
                  goto done;
                }
            }
        }
    }
#  else
  else if (sem_state->magic != BK7258_AP_SEM_WAKE_STATE_MAGIC ||
           sem_state->version != BK7258_AP_SEM_WAKE_STATE_VERSION ||
           sem_state->size != sizeof(struct bk7258_ap_sem_wake_state_s) ||
           sem_state->generation != state->generation ||
           sem_state->state != BK7258_AP_SEM_WAKE_STATE_INITIALIZING ||
           sem_state->error != BK7258_AP_SEM_WAKE_ERROR_NONE)
    {
      bk7258_ap_sem_wake_fail(sem_state,
                             BK7258_AP_SEM_WAKE_ERROR_BAD_STATE);
    }
  else
    {
      sem_state->task_id = (uint32_t)self;
      sem_state->wait_entered = 1;
      sem_state->state = BK7258_AP_SEM_WAKE_STATE_WAITING;
      __asm volatile ("dmb sy; sev" ::: "memory");

      ret = nxsem_wait_uninterruptible(&g_bk7258_ap_cpu1_sem);
      __asm volatile ("dmb sy" ::: "memory");
      wait_state = sem_state->state;
      sem_state->wait_result = (int32_t)ret;
      sem_state->wait_returned = 1;
      sem_state->wake_cpu = (uint32_t)up_cpu_index();
      __asm volatile ("dmb sy" ::: "memory");

      if (ret < 0)
        {
          bk7258_ap_sem_wake_fail(sem_state,
                                 BK7258_AP_SEM_WAKE_ERROR_SEM_WAIT);
        }
      else if (wait_state != BK7258_AP_SEM_WAKE_STATE_POSTED)
        {
          bk7258_ap_sem_wake_fail(sem_state,
                                 BK7258_AP_SEM_WAKE_ERROR_BAD_STATE);
        }
      else if (sem_state->wake_cpu != BK7258_AP_SECONDARY_CPU)
        {
          bk7258_ap_sem_wake_fail(sem_state,
                                 BK7258_AP_SEM_WAKE_ERROR_BAD_CPU);
        }
      else
        {
          sem_state->state = BK7258_AP_SEM_WAKE_STATE_WOKEN;
          __asm volatile ("dmb sy; sev" ::: "memory");
        }
    }
#  endif
#endif

done:
  state->task_completed++;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return NULL;
}
#endif

static void __attribute__((noinline, noreturn, used))
bk7258_ap_secondary_scheduler_entry(void)
{
  volatile struct bk7258_cpu2_probe_state_s *state =
    bk7258_cpu2_probe_state();
  uint32_t control;
  uint32_t msp;

  arm_initialize_stack();
  __asm volatile ("mrs %0, msp" : "=r" (msp));
  __asm volatile ("mrs %0, control" : "=r" (control));

  state->runtime_msp = msp;
  state->control = control;
  state->reserved[0] = BK7258_SCB_CCR;
  state->reserved[1] = BK7258_MPU_CTRL;
  state->online_mask = BK7258_AP_ONLINE_MASK;
  state->secondary_ready = 1;

#ifdef CONFIG_SCHED_INSTRUMENTATION
  sched_note_cpu_started(this_task());
#endif

  bk7258_ap_ipi_mark_scheduler_online();
  state->state = BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE;
  __asm volatile ("dmb sy" ::: "memory");

  /* CPU0 still owns NuttX's scheduler critical section here.  Publish the
   * boot-ready token only after the secondary idle context is complete, but
   * before enabling interrupts: a pending scheduler interrupt can otherwise
   * enter code that waits for CPU0 and deadlock the bootstrap handshake.
   */

  bk7258_cpu2_signal_boot_ready();

  /* nx_idle_trampoline() waits on g_nx_initstate.  The CPU0 reset path can
   * retain a stale private cache line on CPU2, so wait for CPU0's exact
   * post-bringup token and publish the same state into CPU2's local view.
   * CPU0 performs the normal assignment immediately after the wrapper
   * returns.
   */

  bk7258_cpu2_wait_idle_release();
  g_nx_initstate = OSINIT_IDLELOOP;
  __asm volatile ("dmb sy" ::: "memory");

  /* This is the architecture-owned tail of nx_idle_trampoline().  Keeping
   * the first CPU2 sched_unlock() here preserves NuttX's normal secondary
   * idle semantics.  Complete the device-register handshake while interrupts
   * are still disabled, then allow either core's pending scheduler work.
   */

