open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
#ifdef CONFIG_SCHED_INSTRUMENTATION_SWITCH
  sched_note_start(this_task());
#endif

  bk7258_cpu2_signal_scheduler_unlocked();
  if (bk7258_sdk_irq_secondary_online() < 0)
    {
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_IPI_INIT);
      for (; ; )
        {
          __asm volatile ("wfe");
        }
    }

  __asm volatile ("cpsie i; dsb sy; isb sy" ::: "memory");
  sched_unlock();

  for (; ; )
    {
      up_idle();
    }
}

static void __attribute__((naked, noreturn, used))
bk7258_ap_secondary_enter_scheduler(
  uint32_t stack_top __attribute__((unused)))
{
  __asm volatile
    (
      "msr msp, r0\n"
      "dsb sy\n"
      "isb sy\n"
      "b bk7258_ap_secondary_scheduler_entry\n"
    );
}
#endif

static void __attribute__((noinline, noreturn, used))
bk7258_ap_secondary_bootstrap(void)
{
  volatile struct bk7258_cpu2_probe_state_s *state;

  bk7258_cpu2_fpu_initialize();
  state = bk7258_cpu2_probe_state();
  uint32_t control;
  uint32_t msp;

  __asm volatile ("mrs %0, msp" : "=r" (msp));
  __asm volatile ("mrs %0, control" : "=r" (control));

  state->local_core_id = BK7258_CPU2_LOCAL_CORE_ID;
  state->physical_core_id = BK7258_CPU2_PHYSICAL_ID;
  state->runtime_vtor = BK7258_SCB_VTOR;
  state->runtime_msp = msp;
  state->control = control;
  state->boot_count++;
  __asm volatile ("dmb sy" ::: "memory");

  if (state->magic != BK7258_CPU2_PROBE_STATE_MAGIC ||
      state->version != BK7258_CPU2_PROBE_STATE_VERSION ||
      state->size != sizeof(struct bk7258_cpu2_probe_state_s))
    {
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_BAD_BOOT_STATE);
      goto parked;
    }

  state->state = BK7258_CPU2_PROBE_STATE_BOOTSTRAP;
  __asm volatile ("dmb sy" ::: "memory");

  if (*(volatile uint32_t *)BK7258_LOCAL_CORE_ID_ADDR !=
        BK7258_CPU2_LOCAL_CORE_ID ||
      state->physical_core_id != BK7258_CPU2_PHYSICAL_ID)
    {
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_BAD_CORE_ID);
      goto parked;
    }

  if (state->runtime_vtor !=
      (uint32_t)(uintptr_t)__vector_core1_table)
    {
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_BAD_VTOR);
      goto parked;
    }

  if (msp <= BK7258_CPU2_BOOT_STACK_BASE ||
      msp > BK7258_CPU2_BOOT_STACK_TOP)
    {
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_BAD_MSP);
      goto parked;
    }

  if (state->idle_stack_base < BK7258_AP_RAM_BASE ||
      state->idle_stack_base >= state->idle_stack_top ||
      state->idle_stack_top > BK7258_CPU2_BOOT_STACK_BASE)
    {
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_BAD_IDLE_STACK);
      goto parked;
    }

#ifdef CONFIG_BK7258_AP_IPI
  /* NuttX initializes the shared IRQ dispatch table on logical CPU0, but
   * NVIC enable/priority state is private to each STAR core.  Complete the
   * official CPU2-local NVIC setup before enabling any routed peripheral or
   * mailbox interrupt on the secondary core. */

#  ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  if (bk7258_sdk_irq_secondary_initialize() < 0)
    {
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_IPI_INIT);
      goto parked;
    }
#  endif

  if (bk7258_ap_ipi_secondary_initialize() < 0)
    {
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_IPI_INIT);
      goto parked;
    }
#endif

  state->command = BK7258_CPU2_PROBE_COMMAND_NONE;
  state->error = BK7258_CPU2_PROBE_ERROR_NONE;
  state->online_mask = BK7258_AP_PRIMARY_MASK;

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  state->secondary_ready = 0;
  __asm volatile ("dmb sy" ::: "memory");

  if (bk7258_cpu2_scheduler_irq_initialize() < 0)
    {
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_IPI_INIT);
      goto parked;
    }

  bk7258_ap_secondary_enter_scheduler(state->idle_stack_top);
#else
  state->secondary_ready = 1;
  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_CPU2_PROBE_STATE_SECONDARY_READY;
  __asm volatile ("dmb sy; sev" ::: "memory");

#  ifdef CONFIG_BK7258_AP_IPI
  __asm volatile ("cpsie i; dsb sy; isb sy" ::: "memory");
#  endif

  for (; ; )
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->command == BK7258_CPU2_PROBE_COMMAND_STOP)
        {
          state->state = BK7258_CPU2_PROBE_STATE_STOPPING;
          state->secondary_ready = 0;
          __asm volatile ("dmb sy" ::: "memory");
          state->command = BK7258_CPU2_PROBE_COMMAND_NONE;
          state->state = BK7258_CPU2_PROBE_STATE_STOPPED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto parked;
        }

      state->heartbeat++;
#  ifdef CONFIG_BK7258_AP_IPI
      __asm volatile ("dmb sy; dsb sy; wfi" ::: "memory");
#  else
      __asm volatile ("dmb sy; wfe" ::: "memory");
#  endif
    }
#endif

parked:
  __asm volatile ("cpsid i; dsb sy; isb sy" ::: "memory");
  for (; ; )
    {
      __asm volatile ("wfe");
    }
}

static void __attribute__((naked, noreturn, used))
bk7258_ap_secondary_reset(void)
{
  __asm volatile
    (
      "cpsid i\n"
      "movs r0, #0\n"
      "msr control, r0\n"
      "msr basepri, r0\n"
      "msr faultmask, r0\n"
      "ldr r0, =0x20000000\n"
      "movs r1, #1\n"
      "str r1, [r0]\n"
      "ldr r0, =__vector_core1_table\n"
      "ldr r1, =0xe000ed08\n"
      "str r0, [r1]\n"
      "dsb sy\n"
      "isb sy\n"
      "b bk7258_ap_secondary_bootstrap\n"
    );
}

static void __attribute__((noinline, noreturn, used))
bk7258_ap_secondary_fault_handler(uint32_t *stack, uint32_t exception)
{
  volatile struct bk7258_cpu2_probe_state_s *state =
    bk7258_cpu2_probe_state();
  uintptr_t frame = (uintptr_t)stack;
  uint32_t error;

  state->fault_exception = exception;
  state->fault_hfsr = BK7258_SCB_HFSR;
  state->fault_cfsr = BK7258_SCB_CFSR;
  state->fault_lr = BK7258_CPU2_INVALID_VALUE;
  state->fault_pc = BK7258_CPU2_INVALID_VALUE;
  state->fault_xpsr = BK7258_CPU2_INVALID_VALUE;

  if ((frame & (sizeof(uint32_t) - 1u)) == 0 &&
      ((frame >= BK7258_CPU2_BOOT_STACK_BASE &&
        frame <= BK7258_CPU2_BOOT_STACK_TOP -
                 BK7258_CPU2_FRAME_WORDS * sizeof(uint32_t))
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
       ||
       (frame >= state->idle_stack_base &&
        frame <= state->idle_stack_top -
                 BK7258_CPU2_FRAME_WORDS * sizeof(uint32_t))
#endif
      ))
    {
      const volatile uint32_t *regs =
        (const volatile uint32_t *)frame;

      state->fault_lr = regs[5];
      state->fault_pc = regs[6];
      state->fault_xpsr = regs[7];
    }

  error = exception == 2u ?
    BK7258_CPU2_PROBE_ERROR_NMI :
    BK7258_CPU2_PROBE_ERROR_HARDFAULT;
  bk7258_cpu2_fail(error);

