open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
  for (; ; )
    {
      __asm volatile ("wfe");
    }
}

static void __attribute__((naked, noreturn, used))
bk7258_ap_secondary_fault_entry(void)
{
  __asm volatile
    (
      "tst lr, #4\n"
      "ite eq\n"
      "mrseq r0, msp\n"
      "mrsne r0, psp\n"
      "mrs r1, ipsr\n"
      "b bk7258_ap_secondary_fault_handler\n"
    );
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
void __wrap_nx_bringup(void)
{
  __real_nx_bringup();
  bk7258_cpu2_signal_idle_release();
  bk7258_cpu2_wait_scheduler_unlocked();
}
#endif

int up_cpu_index(void)
{
  uint32_t cpu = *(volatile uint32_t *)BK7258_LOCAL_CORE_ID_ADDR;

  return cpu == BK7258_AP_SECONDARY_CPU ?
    BK7258_AP_SECONDARY_CPU : BK7258_AP_PRIMARY_CPU;
}

uintptr_t up_get_intstackbase(int cpu)
{
  if (cpu == BK7258_AP_SECONDARY_CPU)
    {
      return BK7258_CPU2_BOOT_STACK_BASE;
    }

  return (uintptr_t)g_intstackalloc;
}

int up_cpu_idlestack(int cpu, struct tcb_s *tcb, size_t stack_size)
{
  int ret;

  if (cpu != BK7258_AP_SECONDARY_CPU || tcb == NULL)
    {
      return -EINVAL;
    }

  ret = up_create_stack(tcb, stack_size, TCB_FLAG_TTYPE_KERNEL);
  if (ret >= 0)
    {
      tcb->affinity = (cpu_set_t)1u << cpu;
    }

  return ret;
}

int up_cpu_start(int cpu)
{
  volatile struct bk7258_cpu2_probe_state_s *state =
    bk7258_cpu2_probe_state();
  volatile uint32_t *control = bk7258_cpu2_control();
  struct tcb_s *tcb;
  uintptr_t idle_base;
  uintptr_t idle_top;
  uint32_t generation;
  uint32_t value;
  int ret;

  if (cpu != BK7258_AP_SECONDARY_CPU)
    {
      return -EINVAL;
    }

  bk7258_cpu2_hold_reset(state);
  up_mdelay(1);

  generation = bk7258_ap_boot_state()->generation;
  if (generation == 0)
    {
      generation = 1;
    }

  memset((void *)(uintptr_t)state, 0, sizeof(*state));
  state->version = BK7258_CPU2_PROBE_STATE_VERSION;
  state->size = sizeof(*state);
  state->generation = generation;
  state->command = BK7258_CPU2_PROBE_COMMAND_START;
  state->state = BK7258_CPU2_PROBE_STATE_STARTING;
  state->local_core_id = BK7258_CPU2_LOCAL_CORE_ID;
  state->physical_core_id = BK7258_CPU2_PHYSICAL_ID;
  state->vector = (uint32_t)(uintptr_t)__vector_core1_table;
  state->initial_msp = BK7258_CPU2_BOOT_STACK_TOP;
  state->secondary_entry =
    (uint32_t)(uintptr_t)bk7258_ap_secondary_bootstrap;
  state->online_mask = BK7258_AP_PRIMARY_MASK;

  tcb = current_task(cpu);
  if (tcb == NULL || tcb->stack_base_ptr == NULL ||
      tcb->adj_stack_size == 0)
    {
      state->magic = BK7258_CPU2_PROBE_STATE_MAGIC;
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_BAD_IDLE_STACK);
      return -ENOMEM;
    }

  idle_base = (uintptr_t)tcb->stack_base_ptr;
  idle_top = idle_base + tcb->adj_stack_size;
  state->idle_stack_base = (uint32_t)idle_base;
  state->idle_stack_top = (uint32_t)idle_top;

  if (idle_base < BK7258_AP_RAM_BASE || idle_base >= idle_top ||
      idle_top > BK7258_CPU2_BOOT_STACK_BASE)
    {
      state->magic = BK7258_CPU2_PROBE_STATE_MAGIC;
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_BAD_IDLE_STACK);
      return -ENOMEM;
    }

  value = *control;
  state->control_before = value;
  value &= ~(BK7258_SYS_CPU2_RESET |
             BK7258_SYS_CPU2_POWER_DOWN |
             BK7258_SYS_CPU2_HALT |
             BK7258_SYS_CPU2_RXEVT_SEL |
             BK7258_SYS_CPU2_BOOT_MASK);
  value |= BK7258_SYS_CPU2_RXEVT_SEL;
  value |= state->vector & BK7258_SYS_CPU2_BOOT_MASK;
  *control = value;
  __asm volatile ("dsb sy; isb sy" ::: "memory");

  state->control_after = value;
  __asm volatile ("dmb sy" ::: "memory");
  state->magic = BK7258_CPU2_PROBE_STATE_MAGIC;
  __asm volatile ("dmb sy" ::: "memory");

#ifdef CONFIG_BK7258_AP_IPI
  ret = bk7258_ap_ipi_primary_initialize();
  if (ret < 0)
    {
      bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_IPI_INIT);
      return ret;
    }
#endif

  value |= BK7258_SYS_CPU2_RESET;
  *control = value;
  state->control_after = value;
  __asm volatile ("dsb sy; sev" ::: "memory");

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  ret = bk7258_cpu2_wait(BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE,
                         BK7258_CPU2_PROBE_TIMEOUT_MS);
#else
  ret = bk7258_cpu2_wait(BK7258_CPU2_PROBE_STATE_SECONDARY_READY,
                         BK7258_CPU2_PROBE_TIMEOUT_MS);
#endif
  if (ret < 0)
    {
      bk7258_cpu2_hold_reset(state);
      if (state->state != BK7258_CPU2_PROBE_STATE_FAILED)
        {
          bk7258_cpu2_fail(BK7258_CPU2_PROBE_ERROR_TIMEOUT);
        }
    }

  return ret;
}

int up_send_smp_sched(int cpu)
{
  int self = up_cpu_index();
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  volatile struct bk7258_cpu2_probe_state_s *state =
    bk7258_cpu2_probe_state();
  int ret;
#endif

  if (cpu == self)
    {
      return OK;
    }

  if (cpu < BK7258_AP_PRIMARY_CPU || cpu > BK7258_AP_SECONDARY_CPU)
    {
      return -EINVAL;
    }

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  ret = bk7258_ap_ipi_send_smp(cpu);
  if (ret >= 0 &&
      state->magic == BK7258_CPU2_PROBE_STATE_MAGIC)
    {
      state->smp_call_requests++;
      __asm volatile ("dmb sy" ::: "memory");
    }

  return ret;
#else
  bk7258_cpu2_note_missing_ipi();
  return -ENOSYS;
#endif
}

void up_send_smp_call(cpu_set_t cpuset)
{
  int cpu;
  int self = up_cpu_index();

  for (cpu = 0; cpu < CONFIG_SMP_NCPUS; cpu++)
    {
      if ((cpuset & ((cpu_set_t)1u << cpu)) != 0 && cpu != self)
        {
          (void)up_send_smp_sched(cpu);
        }
    }
}

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
int bk7258_ap_smp_scheduler_selftest(uint32_t timeout_ms)
{
  volatile struct bk7258_ap_smp_state_s *state = bk7258_ap_smp_state();
  uint32_t elapsed;
  int cpu;
  int ret;

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_AP_SMP_DEFAULT_TIMEOUT_MS;
    }

  if (state->magic != BK7258_AP_SMP_STATE_MAGIC ||
      state->version != BK7258_AP_SMP_STATE_VERSION ||
      state->size != sizeof(struct bk7258_ap_smp_state_s) ||
      state->generation != bk7258_ap_boot_state()->generation ||
      state->state != BK7258_AP_SMP_STATE_ONLINE ||
      state->online_mask != BK7258_AP_ONLINE_MASK)
    {
      return -EAGAIN;
    }

  state->error = BK7258_AP_SMP_ERROR_NONE;
  state->requested_count = 2;
  state->completed_count = 0;
  state->test_runs++;
  state->last_callback_cpu = UINT32_MAX;

  for (cpu = 0; cpu < CONFIG_SMP_NCPUS; cpu++)
    {
      state->tx_count[cpu] = 0;
      state->rx_count[cpu] = 0;
      state->coalesced_count[cpu] = 0;
      state->send_failures[cpu] = 0;
      state->call_handler_count[cpu] = 0;
      state->delivered_handler_count[cpu] = 0;
      state->callback_count[cpu] = 0;
      state->last_command[cpu] = 0;
    }

  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_SMP_STATE_TESTING;
  __asm volatile ("dmb sy" ::: "memory");

  nxsched_smp_call_init(&g_bk7258_ap_smp_forward_call,
                        bk7258_ap_smp_secondary_callback,
                        (FAR void *)state);
  ret = nxsched_smp_call_single_async(BK7258_AP_SECONDARY_CPU,
                                      &g_bk7258_ap_smp_forward_call);
  if (ret < 0)
    {
      state->error = BK7258_AP_SMP_ERROR_CALL;
      state->state = BK7258_AP_SMP_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return ret;
    }

  for (elapsed = 0; elapsed < timeout_ms; elapsed++)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->callback_count[BK7258_AP_PRIMARY_CPU] == 1 &&
          state->callback_count[BK7258_AP_SECONDARY_CPU] == 1)
        {
          break;
        }

