open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
      if (state->state == BK7258_AP_SMP_STATE_FAILED)
        {
          return -EIO;
        }

      up_mdelay(1);
      (void)sched_yield();
    }

  if (elapsed == timeout_ms)
    {
      state->error = BK7258_AP_SMP_ERROR_TIMEOUT;
      state->state = BK7258_AP_SMP_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ETIMEDOUT;
    }

  if (state->tx_count[0] < 1 || state->tx_count[1] < 1 ||
      state->rx_count[0] < 1 || state->rx_count[1] < 1 ||
      state->call_handler_count[0] < 1 ||
      state->call_handler_count[1] < 1 ||
      state->delivered_handler_count[0] < 1 ||
      state->delivered_handler_count[1] < 1 ||
      state->send_failures[0] != 0 ||
      state->send_failures[1] != 0 ||
      state->last_callback_cpu != BK7258_AP_PRIMARY_CPU)
    {
      state->error = BK7258_AP_SMP_ERROR_COUNT_MISMATCH;
      state->state = BK7258_AP_SMP_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -EIO;
    }

  state->completed_count = 2;
  state->error = BK7258_AP_SMP_ERROR_NONE;
  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_SMP_STATE_PASSED;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return OK;
}
#endif

#ifdef CONFIG_BK7258_AP_SMP_CPU1_AFFINITY
int bk7258_ap_smp_affinity_selftest(uint32_t timeout_ms)
{
  volatile struct bk7258_ap_affinity_state_s *state =
    bk7258_ap_affinity_state();
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
  volatile struct bk7258_ap_sem_wake_state_s *sem_state =
    bk7258_ap_sem_wake_state();
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  volatile struct bk7258_ap_sem_wake_loop_state_s *loop_state =
    bk7258_ap_sem_wake_loop_state();
#  endif
#endif
  volatile struct bk7258_ap_smp_state_s *smp = bk7258_ap_smp_state();
  volatile struct bk7258_ap_ipi_state_s *ipi = bk7258_ap_ipi_state();
  volatile struct bk7258_cpu2_probe_state_s *cpu2 =
    bk7258_cpu2_probe_state();
#ifndef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
  FAR struct tcb_s *tcb;
#endif
  pthread_attr_t attr;
  pthread_t thread;
  cpu_set_t cpuset = (cpu_set_t)1u << BK7258_AP_SECONDARY_CPU;
  uint32_t elapsed;
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
  int32_t waiter_value;
  int blocked;
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  uint32_t callback_cpu0_before;
  uint32_t callback_cpu1_before;
  uint32_t cycle;
  uint32_t loop_error;
  int first_cycle_completed = 0;
  int sem_initialized = 0;
  int woken;
#  endif
#endif
  int ret;

  if (timeout_ms == 0)
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      timeout_ms = BK7258_AP_SEM_WAKE_LOOP_TIMEOUT_MS;
#elif defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE)
      timeout_ms = BK7258_AP_SEM_WAKE_TIMEOUT_MS;
#else
      timeout_ms = BK7258_AP_AFFINITY_TIMEOUT_MS;
#endif
    }

  memset((void *)(uintptr_t)state, 0, sizeof(*state));
  state->version = BK7258_AP_AFFINITY_STATE_VERSION;
  state->size = sizeof(*state);
  state->generation = bk7258_ap_boot_state()->generation;
  state->state = BK7258_AP_AFFINITY_STATE_INITIALIZING;
  state->requested_mask = (uint32_t)cpuset;
  state->test_runs = 1;
  state->timeout_ms = timeout_ms;
  state->smp_tx_before = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx_before = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_fail_before = smp->send_failures[BK7258_AP_PRIMARY_CPU];
  state->ipi_irq_before = ipi->irq_count[BK7258_AP_SECONDARY_CPU];
  state->ipi_wake_before = ipi->wake_count[BK7258_AP_SECONDARY_CPU];
  state->cpu2_calls_before = cpu2->smp_call_requests;
  __asm volatile ("dmb sy" ::: "memory");
  state->magic = BK7258_AP_AFFINITY_STATE_MAGIC;
  __asm volatile ("dmb sy" ::: "memory");

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
  memset((void *)(uintptr_t)sem_state, 0, sizeof(*sem_state));
  sem_state->version = BK7258_AP_SEM_WAKE_STATE_VERSION;
  sem_state->size = sizeof(*sem_state);
  sem_state->generation = state->generation;
  sem_state->state = BK7258_AP_SEM_WAKE_STATE_INITIALIZING;
  sem_state->test_runs = 1;
  sem_state->timeout_ms = timeout_ms;
  __asm volatile ("dmb sy" ::: "memory");
  sem_state->magic = BK7258_AP_SEM_WAKE_STATE_MAGIC;
  __asm volatile ("dmb sy" ::: "memory");

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  memset((void *)(uintptr_t)loop_state, 0, sizeof(*loop_state));
  loop_state->version = BK7258_AP_SEM_WAKE_LOOP_STATE_VERSION;
  loop_state->size = sizeof(*loop_state);
  loop_state->generation = state->generation;
  loop_state->state = BK7258_AP_SEM_WAKE_LOOP_STATE_INITIALIZING;
  loop_state->requested_cycles = BK7258_AP_SEM_WAKE_LOOP_CYCLES;
  __asm volatile ("dmb sy" ::: "memory");
  loop_state->magic = BK7258_AP_SEM_WAKE_LOOP_STATE_MAGIC;
  __asm volatile ("dmb sy" ::: "memory");

  callback_cpu0_before = smp->callback_count[BK7258_AP_PRIMARY_CPU];
  callback_cpu1_before = smp->callback_count[BK7258_AP_SECONDARY_CPU];
#endif

  ret = nxsem_init(&g_bk7258_ap_cpu1_sem, 0, 0);
  if (ret < 0)
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      bk7258_ap_sem_wake_loop_fail(
        loop_state, BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE);
#endif
      bk7258_ap_sem_wake_fail(sem_state,
                             BK7258_AP_SEM_WAKE_ERROR_SEM_INIT);
      bk7258_ap_affinity_fail(state,
                             BK7258_AP_AFFINITY_ERROR_BAD_STATE);
      return ret;
    }

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  sem_initialized = 1;
#endif

#ifdef CONFIG_PRIORITY_INHERITANCE
  ret = nxsem_set_protocol(&g_bk7258_ap_cpu1_sem, SEM_PRIO_NONE);
  if (ret < 0)
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      bk7258_ap_sem_wake_loop_fail(
        loop_state, BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE);
#endif
      bk7258_ap_sem_wake_fail(sem_state,
                             BK7258_AP_SEM_WAKE_ERROR_SEM_INIT);
      bk7258_ap_affinity_fail(state,
                             BK7258_AP_AFFINITY_ERROR_BAD_STATE);
      return ret;
    }
#endif
#endif

  if (smp->magic != BK7258_AP_SMP_STATE_MAGIC ||
      smp->version != BK7258_AP_SMP_STATE_VERSION ||
      smp->size != sizeof(struct bk7258_ap_smp_state_s) ||
      smp->generation != state->generation ||
      smp->state != BK7258_AP_SMP_STATE_PASSED ||
      smp->error != BK7258_AP_SMP_ERROR_NONE ||
      smp->online_mask != BK7258_AP_ONLINE_MASK ||
      ipi->magic != BK7258_AP_IPI_STATE_MAGIC ||
      ipi->version != BK7258_AP_IPI_STATE_VERSION ||
      ipi->size != sizeof(struct bk7258_ap_ipi_state_s) ||
      ipi->generation != state->generation ||
      ipi->state != BK7258_AP_IPI_STATE_READY ||
      ipi->error != BK7258_AP_IPI_ERROR_NONE ||
      cpu2->state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE ||
      cpu2->online_mask != BK7258_AP_ONLINE_MASK)
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      bk7258_ap_sem_wake_loop_fail(
        loop_state, BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE);
#  endif
      bk7258_ap_sem_wake_fail(sem_state,
                             BK7258_AP_SEM_WAKE_ERROR_BAD_STATE);
#endif
      bk7258_ap_affinity_fail(state,
                             BK7258_AP_AFFINITY_ERROR_BAD_STATE);
      return -EAGAIN;
    }

  ret = pthread_attr_init(&attr);
  if (ret != 0)
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      bk7258_ap_sem_wake_loop_fail(
        loop_state, BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE);
#  endif
      bk7258_ap_sem_wake_fail(sem_state,
                             BK7258_AP_SEM_WAKE_ERROR_BAD_STATE);
#endif
      bk7258_ap_affinity_fail(state, BK7258_AP_AFFINITY_ERROR_ATTR);
      return -ret;
    }

  ret = pthread_attr_setdetachstate(&attr, PTHREAD_CREATE_DETACHED);
  if (ret == 0)
    {
      ret = pthread_attr_setaffinity_np(&attr, sizeof(cpuset), &cpuset);
    }

  if (ret != 0)
    {
      (void)pthread_attr_destroy(&attr);
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      bk7258_ap_sem_wake_loop_fail(
        loop_state, BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE);
#  endif
      bk7258_ap_sem_wake_fail(sem_state,
                             BK7258_AP_SEM_WAKE_ERROR_BAD_STATE);
#endif
      bk7258_ap_affinity_fail(state, BK7258_AP_AFFINITY_ERROR_ATTR);
      return -ret;
    }

  state->state = BK7258_AP_AFFINITY_STATE_DISPATCHING;
  __asm volatile ("dmb sy" ::: "memory");
  ret = pthread_create(&thread, &attr, bk7258_ap_cpu1_affinity_task,
                       (FAR void *)state);
  (void)pthread_attr_destroy(&attr);
  if (ret != 0)
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      bk7258_ap_sem_wake_loop_fail(
        loop_state, BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE);
#  endif
      bk7258_ap_sem_wake_fail(sem_state,
                             BK7258_AP_SEM_WAKE_ERROR_BAD_STATE);
#endif
      bk7258_ap_affinity_fail(state, BK7258_AP_AFFINITY_ERROR_CREATE);
      return -ret;
    }

  state->task_id = (uint32_t)thread;
  __asm volatile ("dmb sy" ::: "memory");

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  for (cycle = 1; cycle <= BK7258_AP_SEM_WAKE_LOOP_CYCLES; cycle++)
    {
      blocked = 0;
      waiter_value = INT32_MAX;
      ret = OK;
      for (elapsed = 0; elapsed < timeout_ms; elapsed++)
        {
          __asm volatile ("dmb sy" ::: "memory");
          if (loop_state->state ==
                BK7258_AP_SEM_WAKE_LOOP_STATE_WAITING &&
              loop_state->wait_sequence == cycle &&
              loop_state->wait_entered == cycle &&
              loop_state->waiter_observed == cycle - 1 &&
              loop_state->post_count == cycle - 1 &&
              loop_state->wait_returned == cycle - 1 &&
              loop_state->completed_cycles == cycle - 1 &&
              state->task_id == (uint32_t)thread &&
              (cycle != 1 ||
               (sem_state->state == BK7258_AP_SEM_WAKE_STATE_WAITING &&
                sem_state->task_id == (uint32_t)thread &&
                sem_state->wait_entered == 1)))
            {
              waiter_value =
                bk7258_ap_sem_exact_waiter_value(thread, cpuset);
              if (waiter_value == -1)
                {
                  blocked = 1;
                  break;
                }
            }

          if (state->state == BK7258_AP_AFFINITY_STATE_FAILED ||
              loop_state->state ==
                BK7258_AP_SEM_WAKE_LOOP_STATE_FAILED ||
              sem_state->state == BK7258_AP_SEM_WAKE_STATE_FAILED ||
              state->task_completed != 0)
            {
              ret = -EIO;
              break;
            }

          up_mdelay(1);
          (void)sched_yield();
        }

