open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
      if (!blocked)
        {
          if (elapsed == timeout_ms)
            {
              loop_error = BK7258_AP_SEM_WAKE_LOOP_ERROR_WAIT_TIMEOUT;
              ret = -ETIMEDOUT;
            }
          else
            {
              loop_error = loop_state->error !=
                             BK7258_AP_SEM_WAKE_LOOP_ERROR_NONE ?
                             loop_state->error :
                             BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE;
              ret = -EIO;
            }

          return bk7258_ap_sem_wake_loop_abort(
            state, sem_state, loop_state, loop_error,
            first_cycle_completed, sem_initialized, ret);
        }

      loop_state->waiter_sem_value = waiter_value;
      loop_state->waiter_observed++;
      if (cycle == 1)
        {
          sem_state->waiter_sem_value = waiter_value;
          sem_state->waiter_observed = 1;
        }

      __asm volatile ("dmb sy" ::: "memory");
      if (loop_state->waiter_observed != cycle)
        {
          return bk7258_ap_sem_wake_loop_abort(
            state, sem_state, loop_state,
            BK7258_AP_SEM_WAKE_LOOP_ERROR_COUNT_MISMATCH,
            first_cycle_completed, sem_initialized, -EIO);
        }

      if (cycle == 1)
        {
          sem_state->state = BK7258_AP_SEM_WAKE_STATE_BLOCKED;
        }

      loop_state->state = BK7258_AP_SEM_WAKE_LOOP_STATE_BLOCKED;
      __asm volatile ("dmb sy" ::: "memory");

      if (cycle == 1)
        {
          sem_state->smp_tx_before =
            smp->tx_count[BK7258_AP_PRIMARY_CPU];
          sem_state->smp_rx_before =
            smp->rx_count[BK7258_AP_SECONDARY_CPU];
          sem_state->smp_fail_before =
            smp->send_failures[BK7258_AP_PRIMARY_CPU];
          sem_state->ipi_irq_before =
            ipi->irq_count[BK7258_AP_SECONDARY_CPU];
          sem_state->ipi_wake_before =
            ipi->wake_count[BK7258_AP_SECONDARY_CPU];
          sem_state->cpu2_calls_before = cpu2->smp_call_requests;

          loop_state->smp_tx_before = sem_state->smp_tx_before;
          loop_state->smp_rx_before = sem_state->smp_rx_before;
          loop_state->smp_fail_before = sem_state->smp_fail_before;
          loop_state->ipi_irq_before = sem_state->ipi_irq_before;
          loop_state->ipi_wake_before = sem_state->ipi_wake_before;
          loop_state->cpu2_calls_before = sem_state->cpu2_calls_before;
        }

      loop_state->post_cpu = (uint32_t)up_cpu_index();
      loop_state->post_count++;
      loop_state->post_sequence = cycle;
      if (cycle == 1)
        {
          sem_state->post_cpu = loop_state->post_cpu;
          sem_state->post_count = 1;
          sem_state->state = BK7258_AP_SEM_WAKE_STATE_POSTED;
        }

      __asm volatile ("dmb sy" ::: "memory");
      loop_state->state = BK7258_AP_SEM_WAKE_LOOP_STATE_POSTED;
      __asm volatile ("dmb sy" ::: "memory");

      ret = nxsem_post(&g_bk7258_ap_cpu1_sem);
      loop_state->post_result = (int32_t)ret;
      if (cycle == 1)
        {
          sem_state->post_result = (int32_t)ret;
        }

      __asm volatile ("dmb sy" ::: "memory");
      if (ret < 0)
        {
          return bk7258_ap_sem_wake_loop_abort(
            state, sem_state, loop_state,
            BK7258_AP_SEM_WAKE_LOOP_ERROR_SEM_POST,
            first_cycle_completed, sem_initialized, ret);
        }

      if (loop_state->post_cpu != BK7258_AP_PRIMARY_CPU)
        {
          return bk7258_ap_sem_wake_loop_abort(
            state, sem_state, loop_state,
            BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_CPU,
            first_cycle_completed, sem_initialized, -EIO);
        }

      woken = 0;
      ret = OK;
      for (elapsed = 0; elapsed < timeout_ms; elapsed++)
        {
          __asm volatile ("dmb sy" ::: "memory");
          if (loop_state->state ==
                BK7258_AP_SEM_WAKE_LOOP_STATE_WOKEN &&
              loop_state->completed_cycles == cycle &&
              loop_state->wait_returned == cycle &&
              loop_state->wake_sequence == cycle)
            {
              woken = 1;
              break;
            }

          if (state->state == BK7258_AP_AFFINITY_STATE_FAILED ||
              loop_state->state ==
                BK7258_AP_SEM_WAKE_LOOP_STATE_FAILED ||
              sem_state->state == BK7258_AP_SEM_WAKE_STATE_FAILED ||
              state->task_completed != 0)
            {
              ret = -EIO;
              break;
            }

          up_mdelay(1);
          (void)sched_yield();
        }

      if (!woken)
        {
          if (elapsed == timeout_ms)
            {
              loop_error = BK7258_AP_SEM_WAKE_LOOP_ERROR_WAKE_TIMEOUT;
              ret = -ETIMEDOUT;
            }
          else
            {
              loop_error = loop_state->error !=
                             BK7258_AP_SEM_WAKE_LOOP_ERROR_NONE ?
                             loop_state->error :
                             BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE;
              ret = -EIO;
            }

          return bk7258_ap_sem_wake_loop_abort(
            state, sem_state, loop_state, loop_error,
            first_cycle_completed, sem_initialized, ret);
        }

      if (cycle == 1)
        {
          sem_state->smp_tx_after =
            smp->tx_count[BK7258_AP_PRIMARY_CPU];
          sem_state->smp_rx_after =
            smp->rx_count[BK7258_AP_SECONDARY_CPU];
          sem_state->smp_fail_after =
            smp->send_failures[BK7258_AP_PRIMARY_CPU];
          sem_state->ipi_irq_after =
            ipi->irq_count[BK7258_AP_SECONDARY_CPU];
          sem_state->ipi_wake_after =
            ipi->wake_count[BK7258_AP_SECONDARY_CPU];
          sem_state->cpu2_calls_after = cpu2->smp_call_requests;
          __asm volatile ("dmb sy" ::: "memory");

          if (sem_state->magic != BK7258_AP_SEM_WAKE_STATE_MAGIC ||
              sem_state->version != BK7258_AP_SEM_WAKE_STATE_VERSION ||
              sem_state->size !=
                sizeof(struct bk7258_ap_sem_wake_state_s) ||
              sem_state->generation != state->generation ||
              sem_state->state != BK7258_AP_SEM_WAKE_STATE_WOKEN ||
              sem_state->error != BK7258_AP_SEM_WAKE_ERROR_NONE ||
              sem_state->task_id != state->task_id ||
              sem_state->test_runs != 1 ||
              sem_state->timeout_ms != timeout_ms ||
              sem_state->wait_entered != 1 ||
              sem_state->waiter_observed != 1 ||
              sem_state->waiter_sem_value != -1 ||
              sem_state->post_cpu != BK7258_AP_PRIMARY_CPU ||
              sem_state->post_count != 1 ||
              sem_state->post_result != 0 ||
              sem_state->wait_returned != 1 ||
              sem_state->wait_result != 0 ||
              sem_state->wake_cpu != BK7258_AP_SECONDARY_CPU ||
              sem_state->smp_tx_after != sem_state->smp_tx_before + 1 ||
              sem_state->smp_rx_after != sem_state->smp_rx_before + 1 ||
              sem_state->smp_fail_after != sem_state->smp_fail_before ||
              sem_state->ipi_irq_after != sem_state->ipi_irq_before + 1 ||
              sem_state->ipi_wake_after !=
                sem_state->ipi_wake_before + 1 ||
              sem_state->cpu2_calls_after !=
                sem_state->cpu2_calls_before + 1)
            {
              return bk7258_ap_sem_wake_loop_abort(
                state, sem_state, loop_state,
                BK7258_AP_SEM_WAKE_LOOP_ERROR_COUNT_MISMATCH,
                first_cycle_completed, sem_initialized, -EIO);
            }

          first_cycle_completed = 1;
        }

