open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
      if (cycle == BK7258_AP_SEM_WAKE_LOOP_CYCLES)
        {
          loop_state->smp_tx_after =
            smp->tx_count[BK7258_AP_PRIMARY_CPU];
          loop_state->smp_rx_after =
            smp->rx_count[BK7258_AP_SECONDARY_CPU];
          loop_state->smp_fail_after =
            smp->send_failures[BK7258_AP_PRIMARY_CPU];
          loop_state->ipi_irq_after =
            ipi->irq_count[BK7258_AP_SECONDARY_CPU];
          loop_state->ipi_wake_after =
            ipi->wake_count[BK7258_AP_SECONDARY_CPU];
          loop_state->cpu2_calls_after = cpu2->smp_call_requests;
          __asm volatile ("dmb sy" ::: "memory");
        }
      else
        {
          loop_state->state = BK7258_AP_SEM_WAKE_LOOP_STATE_CONTINUE;
          __asm volatile ("dmb sy; sev" ::: "memory");
        }
    }
#  else
  blocked = 0;
  ret = OK;
  for (elapsed = 0; elapsed < timeout_ms; elapsed++)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->state == BK7258_AP_AFFINITY_STATE_FAILED ||
          sem_state->state == BK7258_AP_SEM_WAKE_STATE_FAILED ||
          state->task_completed != 0)
        {
          ret = -EIO;
          break;
        }

      if (sem_state->state == BK7258_AP_SEM_WAKE_STATE_WAITING)
        {
          waiter_value = bk7258_ap_sem_exact_waiter_value(thread, cpuset);
          sem_state->waiter_sem_value = waiter_value;
          if (sem_state->task_id == (uint32_t)thread &&
              waiter_value == -1)
            {
              blocked = 1;
              break;
            }
        }

      up_mdelay(1);
      (void)sched_yield();
    }

  if (!blocked)
    {
      if (elapsed == timeout_ms)
        {
          bk7258_ap_sem_wake_fail(
            sem_state, BK7258_AP_SEM_WAKE_ERROR_WAIT_TIMEOUT);
          bk7258_ap_affinity_fail(state,
                                 BK7258_AP_AFFINITY_ERROR_TIMEOUT);
          ret = -ETIMEDOUT;
        }
      else
        {
          bk7258_ap_sem_wake_fail(sem_state,
                                 BK7258_AP_SEM_WAKE_ERROR_BAD_STATE);
          bk7258_ap_affinity_fail(state,
                                 BK7258_AP_AFFINITY_ERROR_BAD_STATE);
          ret = -EIO;
        }

      (void)nxsem_post(&g_bk7258_ap_cpu1_sem);
      return ret;
    }

  sem_state->waiter_observed = 1;
  __asm volatile ("dmb sy" ::: "memory");
  sem_state->state = BK7258_AP_SEM_WAKE_STATE_BLOCKED;
  __asm volatile ("dmb sy" ::: "memory");
  sem_state->smp_tx_before = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  sem_state->smp_rx_before = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  sem_state->smp_fail_before =
    smp->send_failures[BK7258_AP_PRIMARY_CPU];
  sem_state->ipi_irq_before = ipi->irq_count[BK7258_AP_SECONDARY_CPU];
  sem_state->ipi_wake_before =
    ipi->wake_count[BK7258_AP_SECONDARY_CPU];
  sem_state->cpu2_calls_before = cpu2->smp_call_requests;
  sem_state->post_cpu = (uint32_t)up_cpu_index();
  sem_state->post_count = 1;
  __asm volatile ("dmb sy" ::: "memory");
  sem_state->state = BK7258_AP_SEM_WAKE_STATE_POSTED;
  __asm volatile ("dmb sy" ::: "memory");

  ret = nxsem_post(&g_bk7258_ap_cpu1_sem);
  sem_state->post_result = (int32_t)ret;
  __asm volatile ("dmb sy" ::: "memory");
  if (ret < 0)
    {
      bk7258_ap_sem_wake_fail(sem_state,
                             BK7258_AP_SEM_WAKE_ERROR_SEM_POST);
      bk7258_ap_affinity_fail(state,
                             BK7258_AP_AFFINITY_ERROR_BAD_STATE);
      return ret;
    }
#  endif
#endif

  for (elapsed = 0; elapsed < timeout_ms; elapsed++)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->task_completed == 1)
        {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
          if (bk7258_ap_pid_released(thread))
#else
          tcb = nxsched_get_tcb((pid_t)thread);
          if (tcb == NULL)
#endif
            {
              state->pid_released = 1;
              __asm volatile ("dmb sy" ::: "memory");
              break;
            }

#ifndef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
          nxsched_put_tcb(tcb);
#endif
        }

      up_mdelay(1);
      (void)sched_yield();
    }

  if (elapsed == timeout_ms)
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      return bk7258_ap_sem_wake_loop_abort(
        state, sem_state, loop_state,
        BK7258_AP_SEM_WAKE_LOOP_ERROR_WAKE_TIMEOUT,
        first_cycle_completed, sem_initialized, -ETIMEDOUT);
#elif defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE)
      bk7258_ap_sem_wake_fail(sem_state,
                             BK7258_AP_SEM_WAKE_ERROR_WAIT_TIMEOUT);
#endif
      bk7258_ap_affinity_fail(state,
                             BK7258_AP_AFFINITY_ERROR_TIMEOUT);
      return -ETIMEDOUT;
    }

  __asm volatile ("dmb sy" ::: "memory");
  state->smp_tx_after = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx_after = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_fail_after = smp->send_failures[BK7258_AP_PRIMARY_CPU];
  state->ipi_irq_after = ipi->irq_count[BK7258_AP_SECONDARY_CPU];
  state->ipi_wake_after = ipi->wake_count[BK7258_AP_SECONDARY_CPU];
  state->cpu2_calls_after = cpu2->smp_call_requests;
#if defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE) && \
    !defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP)
  sem_state->smp_tx_after = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  sem_state->smp_rx_after = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  sem_state->smp_fail_after =
    smp->send_failures[BK7258_AP_PRIMARY_CPU];
  sem_state->ipi_irq_after = ipi->irq_count[BK7258_AP_SECONDARY_CPU];
  sem_state->ipi_wake_after =
    ipi->wake_count[BK7258_AP_SECONDARY_CPU];
  sem_state->cpu2_calls_after = cpu2->smp_call_requests;
#endif
  __asm volatile ("dmb sy" ::: "memory");

  if (state->state == BK7258_AP_AFFINITY_STATE_FAILED)
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      loop_error = loop_state->error !=
                     BK7258_AP_SEM_WAKE_LOOP_ERROR_NONE ?
                     loop_state->error :
                     BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE;
      return bk7258_ap_sem_wake_loop_abort(
        state, sem_state, loop_state, loop_error,
        first_cycle_completed, sem_initialized, -EIO);
#else
      return -EIO;
#endif
    }

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  if (loop_state->state == BK7258_AP_SEM_WAKE_LOOP_STATE_FAILED ||
      sem_state->state == BK7258_AP_SEM_WAKE_STATE_FAILED)
    {
      loop_error = loop_state->error !=
                     BK7258_AP_SEM_WAKE_LOOP_ERROR_NONE ?
                     loop_state->error :
                     BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_STATE;
      return bk7258_ap_sem_wake_loop_abort(
        state, sem_state, loop_state, loop_error,
        first_cycle_completed, sem_initialized, -EIO);
    }

