open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
  if (sem_state->post_cpu != BK7258_AP_PRIMARY_CPU ||
      sem_state->wake_cpu != BK7258_AP_SECONDARY_CPU ||
      loop_state->post_cpu != BK7258_AP_PRIMARY_CPU ||
      loop_state->wake_cpu != BK7258_AP_SECONDARY_CPU)
    {
      return bk7258_ap_sem_wake_loop_abort(
        state, sem_state, loop_state,
        BK7258_AP_SEM_WAKE_LOOP_ERROR_BAD_CPU,
        first_cycle_completed, sem_initialized, -EIO);
    }
#  else
  if (sem_state->state == BK7258_AP_SEM_WAKE_STATE_FAILED)
    {
      bk7258_ap_affinity_fail(state,
                             BK7258_AP_AFFINITY_ERROR_BAD_STATE);
      return -EIO;
    }

  if (sem_state->post_cpu != BK7258_AP_PRIMARY_CPU ||
      sem_state->wake_cpu != BK7258_AP_SECONDARY_CPU)
    {
      bk7258_ap_sem_wake_fail(sem_state,
                             BK7258_AP_SEM_WAKE_ERROR_BAD_CPU);
      bk7258_ap_affinity_fail(
        state, BK7258_AP_AFFINITY_ERROR_COUNT_MISMATCH);
      return -EIO;
    }
#  endif
#endif

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  if (loop_state->wait_sequence != BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->post_sequence != BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->wake_sequence != BK7258_AP_SEM_WAKE_LOOP_CYCLES)
    {
      return bk7258_ap_sem_wake_loop_abort(
        state, sem_state, loop_state,
        BK7258_AP_SEM_WAKE_LOOP_ERROR_SEQUENCE,
        first_cycle_completed, sem_initialized, -EIO);
    }

  if (sem_state->magic != BK7258_AP_SEM_WAKE_STATE_MAGIC ||
      sem_state->version != BK7258_AP_SEM_WAKE_STATE_VERSION ||
      sem_state->size != sizeof(struct bk7258_ap_sem_wake_state_s) ||
      sem_state->generation != state->generation ||
      sem_state->state != BK7258_AP_SEM_WAKE_STATE_WOKEN ||
      sem_state->error != BK7258_AP_SEM_WAKE_ERROR_NONE ||
      sem_state->task_id != state->task_id ||
      sem_state->test_runs != 1 ||
      sem_state->timeout_ms != timeout_ms ||
      sem_state->wait_entered != 1 ||
      sem_state->waiter_observed != 1 ||
      sem_state->waiter_sem_value != -1 ||
      sem_state->post_cpu != BK7258_AP_PRIMARY_CPU ||
      sem_state->post_count != 1 ||
      sem_state->post_result != 0 ||
      sem_state->wait_returned != 1 ||
      sem_state->wait_result != 0 ||
      sem_state->wake_cpu != BK7258_AP_SECONDARY_CPU ||
      sem_state->smp_tx_after != sem_state->smp_tx_before + 1 ||
      sem_state->smp_rx_after != sem_state->smp_rx_before + 1 ||
      sem_state->smp_fail_after != sem_state->smp_fail_before ||
      sem_state->ipi_irq_after != sem_state->ipi_irq_before + 1 ||
      sem_state->ipi_wake_after != sem_state->ipi_wake_before + 1 ||
      sem_state->cpu2_calls_after != sem_state->cpu2_calls_before + 1)
    {
      bk7258_ap_sem_wake_fail(
        sem_state, BK7258_AP_SEM_WAKE_ERROR_COUNT_MISMATCH);
      return bk7258_ap_sem_wake_loop_abort(
        state, sem_state, loop_state,
        BK7258_AP_SEM_WAKE_LOOP_ERROR_COUNT_MISMATCH,
        first_cycle_completed, sem_initialized, -EIO);
    }

  if (state->magic != BK7258_AP_AFFINITY_STATE_MAGIC ||
      state->version != BK7258_AP_AFFINITY_STATE_VERSION ||
      state->size != sizeof(struct bk7258_ap_affinity_state_s) ||
      state->generation != bk7258_ap_boot_state()->generation ||
      state->state != BK7258_AP_AFFINITY_STATE_RUNNING ||
      state->error != BK7258_AP_AFFINITY_ERROR_NONE ||
      state->task_id != (uint32_t)thread ||
      state->task_started != 1 || state->task_completed != 1 ||
      state->pid_released != 1 ||
      state->test_runs != 1 || state->timeout_ms != timeout_ms ||
      state->task_cpu != BK7258_AP_SECONDARY_CPU ||
      state->requested_mask !=
        ((uint32_t)1u << BK7258_AP_SECONDARY_CPU) ||
      state->observed_mask != state->requested_mask ||
      state->smp_tx_after != state->smp_tx_before +
        BK7258_AP_SEM_WAKE_LOOP_CYCLES + 1u ||
      state->smp_rx_after != state->smp_rx_before +
        BK7258_AP_SEM_WAKE_LOOP_CYCLES + 1u ||
      state->ipi_irq_after != state->ipi_irq_before +
        BK7258_AP_SEM_WAKE_LOOP_CYCLES + 1u ||
      state->ipi_wake_after != state->ipi_wake_before +
        BK7258_AP_SEM_WAKE_LOOP_CYCLES + 1u ||
      state->cpu2_calls_after != state->cpu2_calls_before +
        BK7258_AP_SEM_WAKE_LOOP_CYCLES + 1u ||
      state->smp_fail_after != state->smp_fail_before ||
      loop_state->magic != BK7258_AP_SEM_WAKE_LOOP_STATE_MAGIC ||
      loop_state->version != BK7258_AP_SEM_WAKE_LOOP_STATE_VERSION ||
      loop_state->size !=
        sizeof(struct bk7258_ap_sem_wake_loop_state_s) ||
      loop_state->generation != state->generation ||
      loop_state->state != BK7258_AP_SEM_WAKE_LOOP_STATE_WOKEN ||
      loop_state->error != BK7258_AP_SEM_WAKE_LOOP_ERROR_NONE ||
      loop_state->requested_cycles != BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->completed_cycles != BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->wait_entered != BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->waiter_observed != BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->post_count != BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->wait_returned != BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->waiter_sem_value != -1 ||
      loop_state->post_cpu != BK7258_AP_PRIMARY_CPU ||
      loop_state->post_result != 0 ||
      loop_state->wait_result != 0 ||
      loop_state->wake_cpu != BK7258_AP_SECONDARY_CPU ||
      loop_state->smp_tx_after != loop_state->smp_tx_before +
        BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->smp_rx_after != loop_state->smp_rx_before +
        BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->smp_fail_after != loop_state->smp_fail_before ||
      loop_state->ipi_irq_after != loop_state->ipi_irq_before +
        BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->ipi_wake_after != loop_state->ipi_wake_before +
        BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      loop_state->cpu2_calls_after != loop_state->cpu2_calls_before +
        BK7258_AP_SEM_WAKE_LOOP_CYCLES ||
      smp->state != BK7258_AP_SMP_STATE_PASSED ||
      smp->error != BK7258_AP_SMP_ERROR_NONE ||
      smp->online_mask != BK7258_AP_ONLINE_MASK ||
      smp->callback_count[BK7258_AP_PRIMARY_CPU] !=
        callback_cpu0_before ||
      smp->callback_count[BK7258_AP_SECONDARY_CPU] !=
        callback_cpu1_before ||
      smp->coalesced_count[BK7258_AP_PRIMARY_CPU] != 0 ||
      smp->coalesced_count[BK7258_AP_SECONDARY_CPU] != 0 ||
      smp->send_failures[BK7258_AP_PRIMARY_CPU] != 0 ||
      smp->send_failures[BK7258_AP_SECONDARY_CPU] != 0 ||
      ipi->state != BK7258_AP_IPI_STATE_READY ||
      ipi->error != BK7258_AP_IPI_ERROR_NONE ||
      ipi->send_failures[BK7258_AP_PRIMARY_CPU] != 0 ||
      ipi->send_failures[BK7258_AP_SECONDARY_CPU] != 0 ||
      ipi->stale_count != 0 || ipi->spurious_count != 0 ||
      cpu2->state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE ||
      cpu2->online_mask != BK7258_AP_ONLINE_MASK)
    {
      return bk7258_ap_sem_wake_loop_abort(
        state, sem_state, loop_state,
        BK7258_AP_SEM_WAKE_LOOP_ERROR_COUNT_MISMATCH,
        first_cycle_completed, sem_initialized, -EIO);
    }

  sem_state->error = BK7258_AP_SEM_WAKE_ERROR_NONE;
  __asm volatile ("dmb sy" ::: "memory");
  sem_state->state = BK7258_AP_SEM_WAKE_STATE_PASSED;
  __asm volatile ("dmb sy" ::: "memory");

