open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp.c
  loop_state->error = BK7258_AP_SEM_WAKE_LOOP_ERROR_NONE;
  __asm volatile ("dmb sy" ::: "memory");
  loop_state->state = BK7258_AP_SEM_WAKE_LOOP_STATE_PASSED;
  __asm volatile ("dmb sy" ::: "memory");
#else
  if (state->state != BK7258_AP_AFFINITY_STATE_RUNNING ||
      state->task_started != 1 || state->task_completed != 1 ||
      state->pid_released != 1 ||
      state->task_cpu != BK7258_AP_SECONDARY_CPU ||
      state->requested_mask !=
        ((uint32_t)1u << BK7258_AP_SECONDARY_CPU) ||
      state->observed_mask != state->requested_mask ||
      state->smp_tx_after <= state->smp_tx_before ||
      state->smp_rx_after <= state->smp_rx_before ||
      state->ipi_irq_after <= state->ipi_irq_before ||
      state->ipi_wake_after <= state->ipi_wake_before ||
      state->cpu2_calls_after <= state->cpu2_calls_before ||
      state->smp_fail_after != state->smp_fail_before ||
      smp->state != BK7258_AP_SMP_STATE_PASSED ||
      smp->error != BK7258_AP_SMP_ERROR_NONE ||
      cpu2->state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
      || sem_state->magic != BK7258_AP_SEM_WAKE_STATE_MAGIC
      || sem_state->version != BK7258_AP_SEM_WAKE_STATE_VERSION
      || sem_state->size != sizeof(struct bk7258_ap_sem_wake_state_s)
      || sem_state->generation != state->generation
      || sem_state->state != BK7258_AP_SEM_WAKE_STATE_WOKEN
      || sem_state->error != BK7258_AP_SEM_WAKE_ERROR_NONE
      || sem_state->task_id != state->task_id
      || sem_state->test_runs != 1
      || sem_state->timeout_ms != timeout_ms
      || sem_state->wait_entered != 1
      || sem_state->waiter_observed != 1
      || sem_state->waiter_sem_value != -1
      || sem_state->post_count != 1
      || sem_state->post_result != 0
      || sem_state->wait_returned != 1
      || sem_state->wait_result != 0
      || sem_state->smp_tx_after != sem_state->smp_tx_before + 1
      || sem_state->smp_rx_after != sem_state->smp_rx_before + 1
      || sem_state->smp_fail_after != sem_state->smp_fail_before
      || sem_state->ipi_irq_after != sem_state->ipi_irq_before + 1
      || sem_state->ipi_wake_after != sem_state->ipi_wake_before + 1
      || sem_state->cpu2_calls_after !=
         sem_state->cpu2_calls_before + 1
      || smp->coalesced_count[BK7258_AP_PRIMARY_CPU] != 0
      || smp->coalesced_count[BK7258_AP_SECONDARY_CPU] != 0
      || ipi->state != BK7258_AP_IPI_STATE_READY
      || ipi->error != BK7258_AP_IPI_ERROR_NONE
      || ipi->stale_count != 0
      || ipi->spurious_count != 0
#endif
      )
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
      bk7258_ap_sem_wake_fail(
        sem_state, BK7258_AP_SEM_WAKE_ERROR_COUNT_MISMATCH);
#endif
      bk7258_ap_affinity_fail(
        state, BK7258_AP_AFFINITY_ERROR_COUNT_MISMATCH);
      return -EIO;
    }

#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE
  sem_state->error = BK7258_AP_SEM_WAKE_ERROR_NONE;
  __asm volatile ("dmb sy" ::: "memory");
  sem_state->state = BK7258_AP_SEM_WAKE_STATE_PASSED;
  __asm volatile ("dmb sy" ::: "memory");
#endif
#endif

  state->error = BK7258_AP_AFFINITY_ERROR_NONE;
  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_AFFINITY_STATE_PASSED;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return OK;
}
#endif

int bk7258_ap_smp_secondary_stop(uint32_t timeout_ms)
{
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  (void)timeout_ms;
  return -ENOTSUP;
#else
  volatile struct bk7258_cpu2_probe_state_s *state =
    bk7258_cpu2_probe_state();
  int ret = OK;

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_CPU2_PROBE_STOP_TIMEOUT_MS;
    }

  if (state->magic != BK7258_CPU2_PROBE_STATE_MAGIC ||
      state->version != BK7258_CPU2_PROBE_STATE_VERSION)
    {
      ret = -EIO;
    }
  else if (state->state == BK7258_CPU2_PROBE_STATE_SECONDARY_READY ||
           state->state == BK7258_CPU2_PROBE_STATE_BOOTSTRAP ||
           state->state == BK7258_CPU2_PROBE_STATE_STARTING)
    {
      state->command = BK7258_CPU2_PROBE_COMMAND_STOP;
      __asm volatile ("dmb sy" ::: "memory");
#ifdef CONFIG_BK7258_AP_IPI
      ret = bk7258_ap_ipi_wake_secondary();
      if (ret >= 0)
        {
          ret = bk7258_cpu2_wait(BK7258_CPU2_PROBE_STATE_STOPPED,
                                 timeout_ms);
        }
#else
      __asm volatile ("sev" ::: "memory");
      ret = bk7258_cpu2_wait(BK7258_CPU2_PROBE_STATE_STOPPED,
                             timeout_ms);
#endif
    }
  else if (state->state == BK7258_CPU2_PROBE_STATE_FAILED)
    {
      ret = -EIO;
    }

  bk7258_cpu2_hold_reset(state);
  state->secondary_ready = 0;
  __asm volatile ("dmb sy" ::: "memory");

#ifdef CONFIG_BK7258_AP_IPI
  if (ret >= 0)
    {
      bk7258_ap_ipi_mark_stopped();
    }
#endif

  if (ret < 0 && state->state != BK7258_CPU2_PROBE_STATE_FAILED)
    {
      bk7258_cpu2_fail(ret == -ETIMEDOUT ?
        BK7258_CPU2_PROBE_ERROR_TIMEOUT :
        BK7258_CPU2_PROBE_ERROR_BAD_BOOT_STATE);
    }

  return ret;
#endif
}

/****************************************************************************
 * Public Data
 ****************************************************************************/

__attribute__((section(".vectors_core1"), used, aligned(512)))
const void *const __vector_core1_table[BK7258_CPU2_VECTOR_COUNT] =
{
  [0] = (void *)BK7258_CPU2_BOOT_STACK_TOP,
  [1] = (void *)bk7258_ap_secondary_reset,
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  [2 ... 3] = &bk7258_ap_secondary_fault_entry,
  [4 ... 79] = &exception_common
#else
  [2 ... 78] = &bk7258_ap_secondary_fault_entry,
#  ifdef CONFIG_BK7258_AP_IPI
  [BK7258_IRQ_MAILBOX] = &exception_common
#  else
  [BK7258_IRQ_MAILBOX] = &bk7258_ap_secondary_fault_entry
#  endif
#endif
};

#endif /* CONFIG_BK7258_AP_SMP_BOOTSTRAP */
